Repository: Yar177/ax-academy
Catalog: AX Academy/Localization/*.lproj/Localizable.strings
Languages: es, fr

# welcome_subtitle
source: Choose your grade level to start learning
es: Elige tu grado para empezar a aprender
fr: Choisissez votre niveau pour commencer

# welcome_title
source: Welcome
es: Bienvenido
fr: Bienvenue

# tab_student
source: Learners
es: Estudiantes
fr: Élèves

# tab_caregiver
source: Caregivers
es: Familia
fr: Adultes

# update_required_title
source: Update Available
es: Actualización disponible
fr: Mise à jour disponible

# update_required_message
source: Please update to version %@ or later to keep enjoying new lessons.
es: Actualiza a la versión %@ o superior para seguir disfrutando de nuevas lecciones.
fr: Mettez à jour vers la version %@ ou ultérieure pour profiter des nouvelles leçons.

# update_required_ok
source: Got it
es: Entendido
fr: Compris

# consent_toolbar_button
source: Privacy
es: Privacidad
fr: Confidentialité

# grade_card_cta
source: Tap to start learning
es: Pulsa para comenzar
fr: Touchez pour commencer

# grade_math_title
source: %@ Math
es: %@ Matemáticas
fr: %@ Maths

# lesson_completed_accessibility
source: Lesson completed
es: Lección completada
fr: Leçon terminée

# lesson_complete_title
source: Great job!
es: ¡Buen trabajo!
fr: Bravo !

# lesson_complete_message
source: You've completed the lesson.
es: Has completado la lección.
fr: Vous avez terminé la leçon.

# lesson_back_to_list
source: Back to Lessons
es: Volver a lecciones
fr: Retour aux leçons

# lesson_feedback_correct
source: Correct!
es: ¡Correcto!

# lesson_feedback_incorrect
source: Try again
es: Inténtalo de nuevo
fr: Réessayez

# lesson_progress_format
source: Question %1$d of %2$d
es: Pregunta %1$d de %2$d
fr: Question %1$d sur %2$d

# dashboard_title
source: Progress
es: Progreso
fr: Progrès

# dashboard_subtitle
source: Family Dashboard
es: Panel familiar
fr: Tableau familial

# dashboard_overview_message
source: Review progress, celebrate mastery badges, and see what's next.
es: Revisa el progreso, celebra las insignias y descubre los siguientes pasos.
fr: Consultez les progrès, célébrez les badges et découvrez la suite.

# dashboard_progress_header
source: Progress by Grade
es: Progreso por grado
fr: Progrès par niveau

# dashboard_lessons_completed
source: %1$d of %2$d lessons complete
es: %1$d de %2$d lecciones completadas
fr: %1$d leçons sur %2$d terminées

# dashboard_accuracy
source: Overall accuracy
es: Precisión global
fr: Précision globale

# dashboard_no_progress
source: No activity yet. Lessons completed will appear here.
es: Aún no hay actividad. Las lecciones completadas aparecerán aquí.
fr: Aucune activité pour le moment. Les leçons terminées apparaîtront ici.

# dashboard_badges_header
source: Mastery Badges
es: Insignias de dominio
fr: Badges de maîtrise

# badge_accuracy_ace
source: Accuracy Ace
es: As de precisión
fr: As de précision

# badge_accuracy_ace_detail
source: Kept answers correct nine times out of ten.
es: Mantiene respuestas correctas nueve de cada diez veces.
fr: Réponses correctes neuf fois sur dix.

# badge_completion_champion
source: Completion Champion
es: Campeón de finalización
fr: Champion de la réussite

# badge_completion_champion_detail
source: Finished every lesson available for this grade.
es: Terminó todas las lecciones disponibles para este grado.
fr: Toutes les leçons de ce niveau sont terminées.

# badge_keep_going
source: Keep Going
es: Sigue así
fr: Continuez

# badge_keep_going_detail
source: You're building momentum—keep practising together!
es: Están tomando impulso: ¡sigan practicando juntos!
fr: Vous progressez—continuez à pratiquer ensemble !

# dashboard_recommendations_header
source: Recommended Next Steps
es: Siguientes pasos recomendados
fr: Prochaines étapes recommandées

# dashboard_recommendations_empty
source: Recommendations will appear after lessons are completed.
es: Las recomendaciones aparecerán después de completar lecciones.
fr: Les recommandations apparaîtront après les premières leçons.

# dashboard_export_header
source: Share Progress
es: Compartir progreso
fr: Partager le progrès

# dashboard_export_message
source: Export a privacy-safe summary to share with co-teachers or specialists.
es: Exporta un resumen seguro para compartir con docentes o especialistas.
fr: Exportez un résumé sécurisé à partager avec les enseignants ou spécialistes.

# dashboard_share_button
source: Share summary
es: Compartir resumen
fr: Partager le résumé

# dashboard_share_disabled
source: Sharing is disabled until you allow recommendations in privacy settings.
es: El intercambio está desactivado hasta permitir recomendaciones en Privacidad.
fr: Le partage est désactivé tant que vous n'autorisez pas les recommandations.

# safe_mode_title
source: Offline Mode
es: Modo sin conexión
fr: Mode hors ligne

# safe_mode_message
source: We're working offline right now. Progress and lessons are still available, and recommendations will refresh when you're back online.
es: Estamos trabajando sin conexión. El progreso y las lecciones siguen disponibles y las recomendaciones se actualizarán cuando vuelvas.
fr: Nous fonctionnons hors ligne. Les progrès et le contenu restent accessibles; les recommandations se mettront à jour quand la connexion reviendra.

# consent_section_data
source: Data Sharing
es: Compartir datos
fr: Partage des données

# consent_analytics_toggle
source: Allow anonymised learning analytics
es: Permitir analítica de aprendizaje anonimizada
fr: Autoriser l'analyse anonymisée

# consent_recommendations_toggle
source: Allow personalised recommendations
es: Permitir recomendaciones personalizadas
fr: Autoriser les recommandations personnalisées

# consent_data_notice
source: We only store aggregated learning metrics—never names or personal identifiers.
es: Solo guardamos métricas agregadas; nunca nombres ni identificadores.
fr: Nous conservons uniquement des mesures agrégées—jamais de données personnelles.

# consent_privacy_header
source: About Privacy
es: Sobre la privacidad
fr: À propos de la confidentialité

# consent_privacy_copy
source: AX Academy complies with COPPA and GDPR. Caregivers remain in control and can change consent any time.
es: AX Academy cumple con COPPA y RGPD. La familia controla y puede cambiar el consentimiento en cualquier momento.
fr: AX Academy respecte COPPA et RGPD. Les adultes peuvent modifier leur consentement à tout moment.

# consent_title
source: Privacy Controls
es: Controles de privacidad
fr: Contrôles de confidentialité

# consent_cancel
source: Cancel
es: Cancelar
fr: Annuler

# consent_save
source: Save
es: Guardar
fr: Enregistrer

# dashboard_share_template
source: AX Academy Progress Summary: %@
es: Resumen de progreso de AX Academy: %@
fr: Résumé de progrès AX Academy : %@

# fallback_recommendation_read
source: Read a favourite story and count characters together.
es: Lee un cuento favorito y cuenten personajes juntos.
fr: Lisez une histoire favorite et comptez les personnages.

# fallback_recommendation_play
source: Play a quick number or shape hunt around the home.
es: Jueguen a buscar números o formas en casa.
fr: Jouez à chercher des nombres ou des formes dans la maison.

# fallback_recommendation_everyday
source: Use daily routines—like cooking or chores—for math talk moments.
es: Usen rutinas diarias—como cocinar—para conversar sobre matemáticas.
fr: Utilisez les routines quotidiennes, comme la cuisine, pour parler maths.

# grade_kindergarten
source: Kindergarten
es: Kinder
fr: Maternelle

source: Grade 1
es: 1.º grado
fr: CP
